Rotation angle between the principal axes and cross section reference planes.
  Namespace:   Autodesk.Revit.DB.Structure.StructuralSections
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public double PrincipalAxesAngle { get; set; }
  Visual Basic
Public Property PrincipalAxesAngle As Double
	Get
	Set
  Visual C++
public:
property double PrincipalAxesAngle {
	double get ();
	void set (double value);
}
 See Also
  StructuralSectionAnalysisParams Class
  Autodesk.Revit.DB.Structure.StructuralSections Namespace